In [2]:
import pandas as pd
df = pd.read_csv("inconsistent_dataset.csv")
df

    ID    Name          Age       City Salary
0    1  Akshay           25      Delhi  50000
1    2   Rohan          NaN      Noida  45000
2    3   Priya           30      Delhi    NaN
3    4   Sneha           22     Mumbai  40000
4    5   Vikas       Twenty      delhi    40k
5    6   Rahul           27      Noida  48000
6    7    Neha           35       Pune  52000
7    8  Anjali           29  Bangalore  47000
8    9   Arjun          NaN      Delhi  46000
9   10  Simran           24        NaN  45000
10  11    Amit           28     Mumbai    NaN
11  12   Pooja           26      Delhi    55k
12  13  Deepak   Thirty-two      Noida  42000
13  14   Kiran           33  Bengaluru  60000
14  15  Manish           40      Delhi  58000
15  16   Suman           22      Noida  41000
16  17   Vivek           21      Delhi  39000
17  18    Alok           34     Mumbai    NaN
18  19   Nisha           36       PUNE  62000
19  20    Ravi           28      Delhi  50000
20  21   Sahil           23      Noida  47000
21  22   Divya            ?  Bangalore  44000
22  23   Rekha           31      Delhi      ?
23  24  Suresh           29     Mumbai  46000
24  25   Jyoti           27      Noida  45000
25  26   Meena          NaN      Delhi  43000
26  27   Kunal           32      Noida  47000
27  28   Harsh  twenty five  bangalore  49000
28  29    Tina           30       Pune    NaN
29  30     Raj           26      Delhi  52000

In [4]:
df.shape

(30, 5)

In [5]:
df.head()

   ID    Name     Age    City Salary
0   1  Akshay      25   Delhi  50000
1   2   Rohan     NaN   Noida  45000
2   3   Priya      30   Delhi    NaN
3   4   Sneha      22  Mumbai  40000
4   5   Vikas  Twenty   delhi    40k

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      30 non-null     int64
 1   Name    30 non-null     object
 2   Age     27 non-null     object
 3   City    29 non-null     object
 4   Salary  26 non-null     object
dtypes: int64(1), object(4)
memory usage: 1.3+ KB

In [7]:
df.isna().sum()

ID        0
Name      0
Age       3
City      1
Salary    4
dtype: int64

In [9]:
print(df['Age'].unique())
print(df['City'].unique())
print(df['Salary'].unique())

['25' nan '30' '22' 'Twenty' '27' '35' '29' '24' '28' '26' 'Thirty-two'
 '33' '40' '21' '34' '36' '23' '?' '31' '32' 'twenty five']
['Delhi' 'Noida' 'Mumbai' 'delhi' 'Pune' 'Bangalore' nan 'Bengaluru'
 'PUNE' 'bangalore']
['50000' '45000' nan '40000' '40k' '48000' '52000' '47000' '46000' '55k'
 '42000' '60000' '58000' '41000' '39000' '62000' '44000' '?' '43000'
 '49000']

In [10]:
for col in ['Name','City'] : 
    mask = df[col].str.len() != df[col].str.strip().str.len()
    if mask.any():
        print(f"\nValues with whitespaces in {col}:")
        print(df.loc[mask,col])
df[['Name','City']] = df[['Name','City']].apply(lambda x: x.str.strip())
print("\n After trimming white space : ")
print(df)

Values with whitespaces in City:
9    NaN
Name: City, dtype: object

 After trimming white space :
    ID    Name          Age       City Salary
0    1  Akshay           25      Delhi  50000
1    2   Rohan          NaN      Noida  45000
2    3   Priya           30      Delhi    NaN
3    4   Sneha           22     Mumbai  40000
4    5   Vikas       Twenty      delhi    40k
5    6   Rahul           27      Noida  48000
6    7    Neha           35       Pune  52000
7    8  Anjali           29  Bangalore  47000
8    9   Arjun          NaN      Delhi  46000
9   10  Simran           24        NaN  45000
10  11    Amit           28     Mumbai    NaN
11  12   Pooja           26      Delhi    55k
12  13  Deepak   Thirty-two      Noida  42000
13  14   Kiran           33  Bengaluru  60000
14  15  Manish           40      Delhi  58000
15  16   Suman           22      Noida  41000
16  17   Vivek           21      Delhi  39000
17  18    Alok           34     Mumbai    NaN
18  19   Nisha           36       PUNE  62000
19  20    Ravi           28      Delhi  50000
20  21   Sahil           23      Noida  47000
21  22   Divya            ?  Bangalore  44000
22  23   Rekha           31      Delhi      ?
23  24  Suresh           29     Mumbai  46000
24  25   Jyoti           27      Noida  45000
25  26   Meena          NaN      Delhi  43000
26  27   Kunal           32      Noida  47000
27  28   Harsh  twenty five  bangalore  49000
28  29    Tina           30       Pune    NaN
29  30     Raj           26      Delhi  52000

In [14]:
df['City'] = df['City'].str.title()
print(df['City'].unique())

['Delhi' 'Noida' 'Mumbai' 'Pune' 'Bangalore' nan 'Bengaluru']

In [16]:
df['Age'] = df['Age'].replace({
    'Twenty':20,
    'Thirty-two':32,
    'Twenty five':25
})
print(df)

    ID    Name          Age       City Salary
0    1  Akshay           25      Delhi  50000
1    2   Rohan          NaN      Noida  45000
2    3   Priya           30      Delhi    NaN
3    4   Sneha           22     Mumbai  40000
4    5   Vikas           20      Delhi    40k
5    6   Rahul           27      Noida  48000
6    7    Neha           35       Pune  52000
7    8  Anjali           29  Bangalore  47000
8    9   Arjun          NaN      Delhi  46000
9   10  Simran           24        NaN  45000
10  11    Amit           28     Mumbai    NaN
11  12   Pooja           26      Delhi    55k
12  13  Deepak           32      Noida  42000
13  14   Kiran           33  Bengaluru  60000
14  15  Manish           40      Delhi  58000
15  16   Suman           22      Noida  41000
16  17   Vivek           21      Delhi  39000
17  18    Alok           34     Mumbai    NaN
18  19   Nisha           36       Pune  62000
19  20    Ravi           28      Delhi  50000
20  21   Sahil           23      Noida  47000
21  22   Divya            ?  Bangalore  44000
22  23   Rekha           31      Delhi      ?
23  24  Suresh           29     Mumbai  46000
24  25   Jyoti           27      Noida  45000
25  26   Meena          NaN      Delhi  43000
26  27   Kunal           32      Noida  47000
27  28   Harsh  twenty five  Bangalore  49000
28  29    Tina           30       Pune    NaN
29  30     Raj           26      Delhi  52000

In [22]:
df['Age'] = pd.to_numeric(df['Age'],errors='coerce')
median_age = df['Age'].median()
df['Age'] = df['Age'].fillna(median_age)

In [26]:
df['Salary'] = df['Salary'].astype(str).str.replace(","," ").str.strip()
df['Salary'] = df['Salary'].str.replace("k","000",case = False)

df['Salary'] = pd.to_numeric(df['Salary'],errors='coerce')

median_salary = df['Salary'].median()
df['Salary'] = df['Salary'].fillna(median_salary)
df

    ID    Name   Age       City   Salary
0    1  Akshay  25.0      Delhi  50000.0
1    2   Rohan  28.0      Noida  45000.0
2    3   Priya  30.0      Delhi  47000.0
3    4   Sneha  22.0     Mumbai  40000.0
4    5   Vikas  20.0      Delhi  40000.0
5    6   Rahul  27.0      Noida  48000.0
6    7    Neha  35.0       Pune  52000.0
7    8  Anjali  29.0  Bangalore  47000.0
8    9   Arjun  28.0      Delhi  46000.0
9   10  Simran  24.0        NaN  45000.0
10  11    Amit  28.0     Mumbai  47000.0
11  12   Pooja  26.0      Delhi  55000.0
12  13  Deepak  32.0      Noida  42000.0
13  14   Kiran  33.0  Bengaluru  60000.0
14  15  Manish  40.0      Delhi  58000.0
15  16   Suman  22.0      Noida  41000.0
16  17   Vivek  21.0      Delhi  39000.0
17  18    Alok  34.0     Mumbai  47000.0
18  19   Nisha  36.0       Pune  62000.0
19  20    Ravi  28.0      Delhi  50000.0
20  21   Sahil  23.0      Noida  47000.0
21  22   Divya  28.0  Bangalore  44000.0
22  23   Rekha  31.0      Delhi  47000.0
23  24  Suresh  29.0     Mumbai  46000.0
24  25   Jyoti  27.0      Noida  45000.0
25  26   Meena  28.0      Delhi  43000.0
26  27   Kunal  32.0      Noida  47000.0
27  28   Harsh  28.0  Bangalore  49000.0
28  29    Tina  30.0       Pune  47000.0
29  30     Raj  26.0      Delhi  52000.0

In [24]:
print(df.dtypes)

ID          int64
Name       object
Age       float64
City       object
Salary    float64
dtype: object

In [25]:
print(df.isna().sum())

ID        0
Name      0
Age       0
City      1
Salary    0
dtype: int64

In [27]:
print(df.describe(include='all'))

               ID    Name        Age   City        Salary
count   30.000000      30  30.000000     29     30.000000
unique        NaN      30        NaN      6           NaN
top           NaN  Akshay        NaN  Delhi           NaN
freq          NaN       1        NaN     11           NaN
mean    15.500000     NaN  28.333333    NaN  47600.000000
std      8.803408     NaN   4.588842    NaN   5580.755109
min      1.000000     NaN  20.000000    NaN  39000.000000
25%      8.250000     NaN  26.000000    NaN  45000.000000
50%     15.500000     NaN  28.000000    NaN  47000.000000
75%     22.750000     NaN  30.750000    NaN  49750.000000
max     30.000000     NaN  40.000000    NaN  62000.000000

In [29]:
df['City'] = df['City'].fillna("Delhi")
df

    ID    Name   Age       City   Salary
0    1  Akshay  25.0      Delhi  50000.0
1    2   Rohan  28.0      Noida  45000.0
2    3   Priya  30.0      Delhi  47000.0
3    4   Sneha  22.0     Mumbai  40000.0
4    5   Vikas  20.0      Delhi  40000.0
5    6   Rahul  27.0      Noida  48000.0
6    7    Neha  35.0       Pune  52000.0
7    8  Anjali  29.0  Bangalore  47000.0
8    9   Arjun  28.0      Delhi  46000.0
9   10  Simran  24.0      Delhi  45000.0
10  11    Amit  28.0     Mumbai  47000.0
11  12   Pooja  26.0      Delhi  55000.0
12  13  Deepak  32.0      Noida  42000.0
13  14   Kiran  33.0  Bengaluru  60000.0
14  15  Manish  40.0      Delhi  58000.0
15  16   Suman  22.0      Noida  41000.0
16  17   Vivek  21.0      Delhi  39000.0
17  18    Alok  34.0     Mumbai  47000.0
18  19   Nisha  36.0       Pune  62000.0
19  20    Ravi  28.0      Delhi  50000.0
20  21   Sahil  23.0      Noida  47000.0
21  22   Divya  28.0  Bangalore  44000.0
22  23   Rekha  31.0      Delhi  47000.0
23  24  Suresh  29.0     Mumbai  46000.0
24  25   Jyoti  27.0      Noida  45000.0
25  26   Meena  28.0      Delhi  43000.0
26  27   Kunal  32.0      Noida  47000.0
27  28   Harsh  28.0  Bangalore  49000.0
28  29    Tina  30.0       Pune  47000.0
29  30     Raj  26.0      Delhi  52000.0